Autodesk.Revit.DB.OpeningWrappingCondition
Used by CompoundStructure to describe which shell layers participate in wrapping at openings.
Since:
2012

Autodesk.Revit.DB.OpeningWrappingCondition.ExteriorAndInterior
Both interior and exterior shell layers participate in wrapping at openings.

Autodesk.Revit.DB.OpeningWrappingCondition.Interior
Only the interior shell layers participate in wrapping at openings.

Autodesk.Revit.DB.OpeningWrappingCondition.Exterior
Only the exterior shell layers participate in wrapping at openings.

Autodesk.Revit.DB.OpeningWrappingCondition.None
None of the shell layers participate in wrapping at openings.